/* 2.0.23
 * В деяких видах спортивних змагань виступ кожного спортсмена незалежно оцінюється деякими
суддями, потім з усієї сукупності оцінок видаляються найбільш висока і найнижча, а для решти
оцінок обчислюється середнє арифметичне, яке і йде в залік спортсмену. Якщо найбільш високу оцінку
виставило декілька суддів, то з сукупності оцінок видаляється лише одна така оцінка; аналогічно
надходять з найбільш низькими оцінками. Дано натуральне число n, дійсні числа   a_1,a_2,...,a_n.
Вважаючи, що a_1,a_2,...,a_n  оцінки, виставлені суддями одному з учасників змагань, визначити
оцінку, яка піде в залік цього спортсмену.
 */

#include <stdio.h>
#include <stdlib.h>
#define MAX 100  // вважатимемо максимально можливим балом від одного судді
#define MIN 0  // вважатимемо мінімально можливим балом від одного судді


int main ()
{
    int n;
    float ans;  // відповідний бал
    printf("n = ");
    scanf_s("%d", &n);

    float* mas = malloc(n * sizeof(int));  // масив оцінок
    int j = 0;
    while (j < n) {
        printf("mas[%d] = ", j);
        scanf_s("%f", &mas[j]);
        if (mas[j] < MIN || mas[j] > MAX) {
            printf("wrong number\n");
            continue;
        }
        j++;
    }

    float sum = 0, max = MIN, min = MAX;  // вважаємо що оцінка не може бути менше 0
    for (int i = 0; i < n; i++) {
        if (mas[i] < min) min = mas[i];
        if (mas[i] > max) max = mas[i];
        sum += mas[i];
    }

    if (n > 2) ans = (sum - min - max) / (float)(n - 2);
    else if (n == 2) ans = (min + max) / 2.0f;
    else ans = sum;

    printf("Mark is %g", ans);
    system("pause");
    return 0;
}
